{
    "format": "graph-model",
    "generatedBy": "2.2.0",
    "convertedBy": "TensorFlow.js Converter v1.7.0",
    "signature": {
        "inputs": {
            "inputs": {
                "name": "Placeholder:0",
                "dtype": "DT_STRING",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "scores": {
                "name": "head/predictions/probabilities:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "30"
                        }
                    ]
                }
            },
            "classes": {
                "name": "head/Tile:0",
                "dtype": "DT_STRING",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "30"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "head/ExpandDims/input",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_STRING"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_STRING",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "30"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding/embedding_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5000"
                                    },
                                    {
                                        "size": "70"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "dnn/hiddenlayer_0/kernel",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "70"
                                    },
                                    {
                                        "size": "512"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "dnn/hiddenlayer_0/bias",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "512"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "dnn/hiddenlayer_1/kernel",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "512"
                                    },
                                    {
                                        "size": "32"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "dnn/hiddenlayer_1/bias",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "32"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "dnn/logits/kernel",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "32"
                                    },
                                    {
                                        "size": "30"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "dnn/logits/bias",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "30"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape_1/shape",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/strided_slice/stack_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "linear/linear_model/content/weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5000"
                                    },
                                    {
                                        "size": "30"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/ignore_value/x",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_STRING"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_STRING",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "Placeholder",
                "op": "Placeholder",
                "attr": {
                    "dtype": {
                        "type": "DT_STRING"
                    },
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                }
                            ]
                        }
                    }
                }
            },
            {
                "name": "map/TensorArrayUnstack/Const",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {}
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "head/strided_slice/stack",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "map/TensorArrayV2_1/element_shape",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "head/Tile/multiples/1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/embedding_lookup/axis",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack_2",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "head/strided_slice/stack_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape/shape",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "head/ExpandDims/dim",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "linear/linear_model/bias_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "30"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "map/Shape",
                "op": "Shape",
                "input": [
                    "Placeholder"
                ],
                "attr": {
                    "T": {
                        "type": "DT_STRING"
                    },
                    "out_type": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "map/TensorArrayUnstack/TensorListFromTensor",
                "op": "TensorListFromTensor",
                "input": [
                    "Placeholder",
                    "map/TensorArrayUnstack/Const"
                ],
                "attr": {
                    "element_dtype": {
                        "type": "DT_STRING"
                    },
                    "shape_type": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "head/ExpandDims",
                "op": "ExpandDims",
                "input": [
                    "head/ExpandDims/input",
                    "head/ExpandDims/dim"
                ],
                "attr": {
                    "T": {
                        "type": "DT_STRING"
                    },
                    "Tdim": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "map/strided_slice",
                "op": "StridedSlice",
                "input": [
                    "map/Shape",
                    "head/strided_slice/stack",
                    "head/strided_slice/stack_1",
                    "head/strided_slice/stack_1"
                ],
                "attr": {
                    "ellipsis_mask": {
                        "i": "0"
                    },
                    "T": {
                        "type": "DT_INT32"
                    },
                    "begin_mask": {
                        "i": "0"
                    },
                    "new_axis_mask": {
                        "i": "0"
                    },
                    "shrink_axis_mask": {
                        "i": "1"
                    },
                    "Index": {
                        "type": "DT_INT32"
                    },
                    "end_mask": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "map/TensorArrayV2_1",
                "op": "TensorListReserve",
                "input": [
                    "map/TensorArrayV2_1/element_shape",
                    "map/strided_slice"
                ],
                "attr": {
                    "shape_type": {
                        "type": "DT_INT32"
                    },
                    "element_dtype": {
                        "type": "DT_STRING"
                    }
                }
            },
            {
                "name": "map/while",
                "op": "StatelessWhile",
                "input": [
                    "head/ExpandDims/dim",
                    "map/strided_slice",
                    "head/ExpandDims/dim",
                    "map/TensorArrayV2_1",
                    "map/strided_slice",
                    "map/TensorArrayUnstack/TensorListFromTensor"
                ],
                "attr": {
                    "cond": {
                        "func": {
                            "name": "map_while_cond_4964"
                        }
                    },
                    "T": {
                        "list": {
                            "type": [
                                "DT_INT32",
                                "DT_INT32",
                                "DT_INT32",
                                "DT_VARIANT",
                                "DT_INT32",
                                "DT_VARIANT"
                            ]
                        }
                    },
                    "parallel_iterations": {
                        "i": "10"
                    },
                    "body": {
                        "func": {
                            "name": "map_while_body_4965"
                        }
                    },
                    "_num_original_outputs": {
                        "i": "6"
                    },
                    "_lower_using_switch_merge": {
                        "b": true
                    },
                    "_read_only_resource_inputs": {
                        "list": {}
                    },
                    "output_shapes": {
                        "list": {
                            "shape": [
                                {},
                                {},
                                {},
                                {},
                                {},
                                {}
                            ]
                        }
                    }
                }
            },
            {
                "name": "map/TensorArrayV2Stack/TensorListStack",
                "op": "TensorListStack",
                "input": [
                    "map/while:3",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape/shape"
                ],
                "attr": {
                    "element_dtype": {
                        "type": "DT_STRING"
                    },
                    "num_elements": {
                        "i": "-1"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/NotEqual",
                "op": "NotEqual",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/ignore_value/x",
                    "map/TensorArrayV2Stack/TensorListStack"
                ],
                "attr": {
                    "T": {
                        "type": "DT_STRING"
                    },
                    "incompatible_shape_error": {
                        "b": true
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/dense_shape",
                "op": "Shape",
                "input": [
                    "map/TensorArrayV2Stack/TensorListStack"
                ],
                "attr": {
                    "T": {
                        "type": "DT_STRING"
                    },
                    "out_type": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/indices",
                "op": "Where",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/NotEqual"
                ],
                "attr": {
                    "T": {
                        "type": "DT_BOOL"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Slice",
                "op": "Slice",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/dense_shape",
                    "head/strided_slice/stack",
                    "head/strided_slice/stack_1"
                ],
                "attr": {
                    "Index": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Cast_1",
                "op": "Cast",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/dense_shape"
                ],
                "attr": {
                    "SrcT": {
                        "type": "DT_INT64"
                    },
                    "DstT": {
                        "type": "DT_INT32"
                    },
                    "Truncate": {
                        "b": false
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2",
                "op": "GatherV2",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/dense_shape",
                    "head/Tile/multiples/1",
                    "head/ExpandDims/dim"
                ],
                "attr": {
                    "Taxis": {
                        "type": "DT_INT32"
                    },
                    "Tindices": {
                        "type": "DT_INT32"
                    },
                    "Tparams": {
                        "type": "DT_INT64"
                    },
                    "batch_dims": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/values",
                "op": "GatherNd",
                "input": [
                    "map/TensorArrayV2Stack/TensorListStack",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/indices"
                ],
                "attr": {
                    "Tindices": {
                        "type": "DT_INT64"
                    },
                    "Tparams": {
                        "type": "DT_STRING"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Prod",
                "op": "Prod",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Slice",
                    "head/strided_slice/stack"
                ],
                "attr": {
                    "Tidx": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_INT64"
                    },
                    "keep_dims": {
                        "b": false
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/strided_slice",
                "op": "StridedSlice",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Cast_1",
                    "head/strided_slice/stack",
                    "head/strided_slice/stack_1",
                    "head/strided_slice/stack_1"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    },
                    "shrink_axis_mask": {
                        "i": "1"
                    },
                    "Index": {
                        "type": "DT_INT32"
                    },
                    "new_axis_mask": {
                        "i": "0"
                    },
                    "begin_mask": {
                        "i": "0"
                    },
                    "ellipsis_mask": {
                        "i": "0"
                    },
                    "end_mask": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/lookup",
                "op": "StringToHashBucketFast",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/values"
                ],
                "attr": {
                    "num_buckets": {
                        "i": "5000"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Cast/x",
                "op": "Pack",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Prod",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT64"
                    },
                    "N": {
                        "i": "2"
                    },
                    "axis": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/Cast/x",
                "op": "Pack",
                "input": [
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/strided_slice",
                    "map/TensorArrayV2_1/element_shape"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT32"
                    },
                    "axis": {
                        "i": "0"
                    },
                    "N": {
                        "i": "2"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GreaterEqual",
                "op": "GreaterEqual",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/lookup",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/embedding_lookup/axis"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseReshape",
                "op": "SparseReshape",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/indices",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/dense_shape",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Cast/x"
                ]
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/Cast",
                "op": "Cast",
                "input": [
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/Cast/x"
                ],
                "attr": {
                    "Truncate": {
                        "b": false
                    },
                    "SrcT": {
                        "type": "DT_INT32"
                    },
                    "DstT": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Where",
                "op": "Where",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GreaterEqual"
                ],
                "attr": {
                    "T": {
                        "type": "DT_BOOL"
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape",
                "op": "SparseReshape",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/indices",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/to_sparse_input/dense_shape",
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/Cast"
                ]
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape",
                "op": "Reshape",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Where",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape/shape"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT64"
                    },
                    "Tshape": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Cast_1",
                "op": "Cast",
                "input": [
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape:1"
                ],
                "attr": {
                    "Truncate": {
                        "b": false
                    },
                    "SrcT": {
                        "type": "DT_INT64"
                    },
                    "DstT": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice",
                "op": "Slice",
                "input": [
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape:1",
                    "head/strided_slice/stack",
                    "head/strided_slice/stack_1"
                ],
                "attr": {
                    "Index": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2",
                "op": "GatherV2",
                "input": [
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape:1",
                    "head/Tile/multiples/1",
                    "head/ExpandDims/dim"
                ],
                "attr": {
                    "batch_dims": {
                        "i": "0"
                    },
                    "Taxis": {
                        "type": "DT_INT32"
                    },
                    "Tparams": {
                        "type": "DT_INT64"
                    },
                    "Tindices": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_1",
                "op": "GatherV2",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseReshape",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape",
                    "head/ExpandDims/dim"
                ],
                "attr": {
                    "batch_dims": {
                        "i": "0"
                    },
                    "Tindices": {
                        "type": "DT_INT64"
                    },
                    "Taxis": {
                        "type": "DT_INT32"
                    },
                    "Tparams": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_2",
                "op": "GatherV2",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/lookup",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape",
                    "head/ExpandDims/dim"
                ],
                "attr": {
                    "Taxis": {
                        "type": "DT_INT32"
                    },
                    "batch_dims": {
                        "i": "0"
                    },
                    "Tparams": {
                        "type": "DT_INT64"
                    },
                    "Tindices": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice_1",
                "op": "Slice",
                "input": [
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Cast_1",
                    "head/strided_slice/stack",
                    "head/strided_slice/stack_1"
                ],
                "attr": {
                    "Index": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Prod",
                "op": "Prod",
                "input": [
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Slice",
                    "head/strided_slice/stack"
                ],
                "attr": {
                    "keep_dims": {
                        "b": false
                    },
                    "Tidx": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseFillEmptyRows/SparseFillEmptyRows",
                "op": "SparseFillEmptyRows",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_1",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/GatherV2_2",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseReshape:1",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/embedding_lookup/axis"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Cast/x",
                "op": "Pack",
                "input": [
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Prod",
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2"
                ],
                "attr": {
                    "N": {
                        "i": "2"
                    },
                    "axis": {
                        "i": "0"
                    },
                    "T": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice",
                "op": "StridedSlice",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseFillEmptyRows/SparseFillEmptyRows",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack_1",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice/stack_2"
                ],
                "attr": {
                    "end_mask": {
                        "i": "1"
                    },
                    "T": {
                        "type": "DT_INT64"
                    },
                    "new_axis_mask": {
                        "i": "0"
                    },
                    "Index": {
                        "type": "DT_INT32"
                    },
                    "begin_mask": {
                        "i": "1"
                    },
                    "shrink_axis_mask": {
                        "i": "2"
                    },
                    "ellipsis_mask": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/Unique",
                "op": "Unique",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseFillEmptyRows/SparseFillEmptyRows:1"
                ],
                "attr": {
                    "out_idx": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape_1",
                "op": "Reshape",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/SparseFillEmptyRows/SparseFillEmptyRows:2",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape_1/shape"
                ],
                "attr": {
                    "Tshape": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_BOOL"
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseReshape",
                "op": "SparseReshape",
                "input": [
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape",
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/SparseReshape:1",
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/Cast/x"
                ]
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/Cast",
                "op": "Cast",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/strided_slice"
                ],
                "attr": {
                    "Truncate": {
                        "b": false
                    },
                    "DstT": {
                        "type": "DT_INT32"
                    },
                    "SrcT": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/embedding_lookup",
                "op": "GatherV2",
                "input": [
                    "dnn/input_from_feature_columns/input_layer/content_embedding/embedding_weights",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/Unique",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse/embedding_lookup/axis"
                ],
                "attr": {
                    "Taxis": {
                        "type": "DT_INT64"
                    },
                    "batch_dims": {
                        "i": "0"
                    },
                    "Tparams": {
                        "type": "DT_FLOAT"
                    },
                    "Tindices": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/GatherV2_1",
                "op": "GatherV2",
                "input": [
                    "linear/linear_model/linear/linear_model/linear/linear_model/content/weighted_sum/SparseReshape",
                    "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/Reshape",
                    "head/ExpandDims/dim"
                ],
                "attr": {
                    "Tindices": {
                        "type": "DT_INT64"
                    },
                    "Tparams": {
                        "type": "DT_INT64"
                    },
                    "Taxis": {
                        "type": "DT_INT32"
                    },
                    "batch_dims": {
                        "i": "0"
                    }
                }
            },
            {
                "name": "dnn/input_from_feature_columns/input_layer/content_embedding_1/content_embedding_weights/embedding_lookup_sparse",
                "op": "SparseSegmentMean",
                "input": [
